' Просто комментарий в UTF-8
PRINT "Basic program with remarks"

  ' Комментарий от пробела

BEEP

REM Комментарий ключевым словом

BEEP

   REM Комментарий ключевым словом от пробела

BEEP 'Комментарий в конце строки
BEEP REM Комментарий в конце строки ключевым словом

BEEP'Комментарий в конце строки вплотную
BEEPREM Комментарий в конце строки ключевым словом вплотную

PRINT " ' Комментарий внутри строки"
PRINT " REM Комментарий внутри строки"
PRINT "Строка"  ' Комментарий
PRINT "Еще строка"  REM Еще комментарий

END
